laminar-coal/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   uniform (0 0 1.7);

boundaryField
{
    WALL
    {
        type            slip;
    }
    OUTLET
    {
        type            zeroGradient;
    }
    INLET
    {
        type            fixedValue;
        value           uniform (0 0 1.7);
    }
    injectionPatch
    {
        type            fixedValue;
        value           uniform (0 0 1.7);
    }
}


// ************************************************************************* //
