laminar-coal/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];


internalField   uniform 101325;
boundaryField
{
    WALL
    {
        type            zeroGradient;
    }
    OUTLET
    {
        type            fixedValue;
        value            uniform 101325;
    }

    INLET
    {
        type            zeroGradient;
    }
    injectionPatch
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
