laminar-coal/0/pd
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      pd;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//
// pd is the low-Mach dynamic/flow pressure solved by pdEqn.H (rho, from
// flameletThermo's thermodynamic p*psi, is unaffected).

dimensions      [1 -1 -2 0 0 0 0];


internalField   uniform 100000;

boundaryField
{
    WALL
    {
        type            zeroGradient;
    }
    OUTLET
    {
        type            fixedValue;
        value            uniform 101325;
    }
    INLET
    {
        type            zeroGradient;
    }
    injectionPatch
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
