laminar-coal/0/G
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      G;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    INLET
    {
        type            MarshakRadiation;
        value           uniform 0;
    }
    OUTLET
    {
        type            MarshakRadiation;
        value           uniform 0;
    }
    WALL
    {
        type            zeroGradient;
    }
    injectionPatch
    {
        type            MarshakRadiation;
        value           uniform 0;
    }
}


// ************************************************************************* //
