laminar-coal/0/Ydefault
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ydefault;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField  uniform 0.0;
boundaryField
{
    INLET
   {
        type            fixedValue;
        value           uniform 0.0;
    }
    OUTLET
    {
        type            zeroGradient;
    }
    WALL
    {
        type            zeroGradient;
    }
    injectionPatch
    {
        type            fixedValue;
        value           uniform 0.0;
    }
}


// ************************************************************************* //
