laminar-coal/0/omega_yc
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega_yc;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 -1 0 0 0 0];


internalField   uniform 0.0;

boundaryField
{
    WALL
    {
        type            zeroGradient;
    }
    OUTLET
    {
        type            zeroGradient;
    }
    INLET
    {
        type            fixedValue;
        value           uniform 0.0;
    }
    injectionPatch
    {
        type            fixedValue;
        value           uniform 0.0;
    }
}


// ************************************************************************* //
