laminar-coal/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
{
    // Mandatory (inherited) entries
    name        injectionCells;
    type        faceSet;
    action      new;

    // Mandatory entries
    source      cylinderToFace;
    p1          (0.0 0.0 -1e-6);
    p2          (0.0 0.0 1e-6);
    radius      1e-3;

}
);


// ************************************************************************* //
